package Strings;

import java.util.Scanner;

public class TaskClass {
    /*
Быки и коровы
0123456789
4239
Пользователь вводит 4 цифры
4567
Компьютер отвечает: 1 бык, 0 коров
5467
Компьютер отвечает: 0 бык, 1 корова

 */
    public static void main(String[] args) {
        String str1="0123456789";
        StringBuilder sb=new StringBuilder();
        Scanner scanner=new Scanner(System.in);
        System.out.println("Введите 4 цифры");
        String str2=scanner.nextLine();

    }
}
